print(5) #выводит переменную на экран

for i in range(0,1,3): #Перебирает значение от 0 да 1 с шагом 3

if n==s: a = s #проверяет условие и если оно истинно выполняет условие 
elif:#вложенное условие, выполняемое, если выражение ложно
else: a = s #если условие ложно выполняет действие

input() #выводит переменную на экран

int() #меняет тип данных на целочисленный

str() #меняет тип данных на строковый

break #завершает выполнение программы

from turtle import #импортирует библиотеки python

forward(300)# движение черепахи вперёд 

backward(300)#движение черепахи назад

right(120)# поворот черевахи направо

left (120) #поворот черевахи налево

dot(5)#ставит точку с радиусом, указанном в скобках

goto(x*30,y*30)#осуществляет переход к определённой точке в коде программы

def f(): #задаёт функцию 
    f = 13 #функция
f #вывод функции

count()#возвращает количество раз, когда указанный элемент появляется в списке

from itertools import product
product()#возвращает декартово произведение входных итерируемых последовательностей 

index() #находит значение индекса элемента в последовательности

len()#возвращает количество элементов(длину) в обьекте

split() #азделяет строку на список подстроек по разделителю

join()#преобразует список в строку

append()#добавляет в список один новый элемент

with open('24.txt') as f: #открывает текстовый фаил и выполняет с ними действия

readline() #
